{"input_text": "Plastic bags", "output_text": "Plastic bags are tricky, but here’s the best way to handle them! 🛍️\n\n⭐⭐⭐⭐⭐ **REDUCE**\nThe most impactful action! Always carry a reusable cloth or jute bag for shopping. Politely refuse plastic bags at stores to prevent waste in the first place.\n\n⭐⭐⭐ **REUSE**\nUse them as bin liners for dry waste or for other household needs until they are no longer usable.\n\n⭐ **RECYCLE**\nOnly clean and dry bags can be placed in dry waste. However, they are low-value and often not recycled, so reduction is a much better goal."}
{"input_text": "PET bottles like soft drink bottles", "output_text": "PET bottles are highly recyclable, but it's even better not to create the waste at all! 🥤\n\n⭐⭐⭐⭐⭐ **REDUCE**\nCarry a reusable water bottle. Opt for water filters at home instead of buying bottled water.\n\n⭐⭐⭐⭐ **RECYCLE**\nThis is a great option as PET is a valuable material. Empty the bottle, crush it, and place it in your dry waste bin.\n\n⭐⭐ **REUSE**\nGood for DIY projects like vertical gardens or bird feeders, but recycling is generally better for turning it back into a useful raw material."}
{"input_text": "Plastic food containers", "output_text": "Those takeaway containers can pile up! Here's the most effective plan for them. 🍱\n\n⭐⭐⭐⭐⭐ **REDUCE**\nCarry your own reusable container when ordering takeaway. Many restaurants in Bengaluru are happy to support this.\n\n⭐⭐⭐ **REUSE**\nWash them thoroughly and use them for storing leftovers, packing lunch, or organizing small items.\n\n⭐⭐ **RECYCLE**\nMake sure they are clean and free of food residue. A quick rinse is usually enough. Place the clean, dry container in your dry waste bin."}
{"input_text": "Aluminum foil", "output_text": "Let's talk about aluminum foil! Here’s the 3R strategy, from best to worst. ✨\n\n⭐⭐⭐⭐⭐ **REDUCE**\nUse reusable containers with lids (like steel dabbas) to store food instead of covering with foil.\n\n⭐⭐⭐ **RECYCLE**\nIt is 100% recyclable! Collect used foil, bunch it up into a ball (at least the size of a lemon), and drop it in your dry waste bin.\n\n⭐ **REUSE**\nIf the foil is clean, you can wipe it and reuse it once or twice. It can also be used to sharpen scissors."}
{"input_text": "Metal food cans", "output_text": "Metal cans are great for recycling! Here’s how to manage them effectively. 🥫\n\n⭐⭐⭐⭐⭐ **RECYCLE**\nSteel and aluminum are valuable and easily recycled. Rinse the can, place the lid inside, and put it in your dry waste or give it to your local 'kabadiwala'.\n\n⭐⭐⭐ **REDUCE**\nBuy fresh or frozen vegetables instead of canned ones where possible. Buy in bulk to reduce the number of cans.\n\n⭐⭐ **REUSE**\nAfter cleaning, they make excellent pen holders or small planters."}
{"input_text": "Old steel utensils", "output_text": "Old or broken steel utensils have value! Don't just throw them away. 🍴\n\n⭐⭐⭐⭐⭐ **RECYCLE**\nSteel is highly valuable. The best action is to sell it to your local 'raddiwala' or scrap metal dealer. They will ensure it gets melted down and recycled properly.\n\n⭐⭐⭐ **REUSE**\nDonate utensils that are still in good condition to someone in need or to a local charity.\n\n⭐ **REDUCE**\nBuy good quality utensils that won't break or rust easily."}
{"input_text": "Expired medicines", "output_text": "Expired medicines are hazardous. The top priority is safe disposal, not recycling or reuse. 💊\n\n⭐⭐⭐⭐⭐ **SAFE DISPOSAL**\nDO NOT flush them or throw them in the regular bin. This is critical. Take them to a pharmacy or a hospital that has a take-back program. This prevents environmental pollution.\n\n⭐⭐⭐ **REDUCE**\nBuy medicines only in the required quantity to avoid them expiring in the first place.\n\n⭐ **REUSE**\nNot possible. Never consume expired medicines. This is a health and safety instruction."}
{"input_text": "Used syringes", "output_text": "DANGER! Used syringes are biomedical waste. There is only one priority: safety. 💉\n\n⭐⭐⭐⭐⭐ **SAFE DISPOSAL**\nNEVER dispose of them in household waste. Place them in a hard, puncture-proof container (like a detergent bottle), seal it, and label it 'SHARPS'. Contact a biomedical waste disposal service or your local clinic/hospital for proper collection. Safety is the only goal here."}
{"input_tExt": "Soiled bandages or cotton", "output_text": "Items with bodily fluids are biomedical waste. Safety for sanitation workers is the top priority. 🩹\n\n⭐⭐⭐⭐⭐ **SAFE DISPOSAL**\nThis is not recyclable. Wrap it securely in a bag or newspaper, and place it in your 'reject' or sanitary waste bin. This prevents sanitation workers from coming into direct contact with it.\n\n⭐ **REUSE / RECYCLE**\nNot possible for safety and hygiene reasons."}
{"input_text": "Magazines and books", "output_text": "Let's give paper from books and magazines a new purpose! 📚\n\n⭐⭐⭐⭐⭐ **REUSE**\nThe best option! Donate books in good condition to libraries, schools, or secondhand bookstores. This keeps the item in its highest form of use.\n\n⭐⭐⭐⭐ **RECYCLE**\nIf they can't be reused, they are fully recyclable. Put them in your dry waste or sell them to the 'raddiwala'.\n\n⭐⭐ **REDUCE**\nOpt for digital subscriptions or e-books. Use local libraries instead of buying every book."}
{"input_text": "Paper cups", "output_text": "Paper cups are mostly waste, so avoiding them is the best strategy. ☕\n\n⭐⭐⭐⭐⭐ **REDUCE**\nThe most effective action! Carry your own reusable coffee mug. Bengaluru has a great coffee culture that supports reusables.\n\n⭐ **REUSE / RECYCLE**\nNot recommended. Most cups have a plastic lining making them unsuitable for recycling. They generally go into the 'reject waste' bin."}
{"input_text": "Pizza boxes", "output_text": "Let's talk about pizza boxes! Recycling them properly is key. 🍕\n\n⭐⭐⭐⭐ **RECYCLE**\nThis is a two-part action. The clean, non-greasy parts of the cardboard can be torn off and recycled. The greasy parts must go into your compost or wet waste bin.\n\n⭐⭐ **REUSE**\nThe clean lid can be used for craft projects.\n\n⭐ **REDUCE**\nDine in to avoid the box altogether!"}
{"input_text": "CFL or LED bulbs", "output_text": "Light bulbs are e-waste. Safe disposal to prevent pollution is the #1 goal. 💡\n\n⭐⭐⭐⭐⭐ **RECYCLE (Safe Disposal)**\nDO NOT throw them in the regular bin, as CFLs contain mercury. They must be taken to a designated e-waste collection point. This is the most responsible action.\n\n⭐⭐⭐ **REDUCE**\nBuy high-quality, long-lasting LED bulbs which are more energy-efficient and last for years, reducing the frequency of disposal."}
{"input_text": "Alkaline batteries (AA, AAA)", "output_text": "Batteries are hazardous waste! Preventing them from ending up in a landfill is the top priority. 🔋\n\n⭐⭐⭐⭐⭐ **RECYCLE (Safe Disposal)**\nCollect them separately and take them to a proper collection point. Look for battery collection boxes in supermarkets, electronics stores, or e-waste centers across the city.\n\n⭐⭐⭐⭐ **REDUCE**\nSwitch to rechargeable batteries. This is a very high-impact change that significantly reduces waste over time."}
{"input_text": "Old keyboards or mice", "output_text": "Broken keyboards and mice are classic e-waste. Here's what to do, from best to worst: 🖱️\n\n⭐⭐⭐⭐⭐ **RECYCLE (Safe Disposal)**\nThey contain various materials that can be recovered. Take them to an authorized e-waste recycler. This prevents hazardous materials from polluting the environment.\n\n⭐⭐⭐ **REUSE**\nIf they are still working, you can donate them to schools or community centers.\n\n⭐⭐ **REDUCE**\nBuy good quality peripherals and clean them regularly to extend their life."}
{"input_text": "Garden waste like leaves and twigs", "output_text": "Garden waste is pure organic goodness! The best thing is to turn it back into soil. 🌿\n\n⭐⭐⭐⭐⭐ **RECYCLE (Compost)**\nThis is 100% compostable and the best outcome. Add it to your home or community compost bin. As per BBMP rules, it goes into your green 'wet waste' bin.\n\n⭐⭐⭐ **REUSE**\nDried leaves can be used as 'brown' material to balance your compost pile or as mulch on top of your potted plants to retain moisture."}
{"input_text": "Coconut shells", "output_text": "Coconut shells are a common item in South Indian kitchens! They are very versatile. 🥥\n\n⭐⭐⭐⭐ **REUSE**\nThis is a great option. They are famously used as serving bowls, for craft projects, or as a fuel source in traditional stoves.\n\n⭐⭐⭐ **RECYCLE**\nThey are organic but break down very slowly. You can put them in your wet waste bin, but it's better to give them to vendors who use them for fuel or to specialized processors."}
{"input_text": "Tea bags and coffee grounds", "output_text": "Your daily chai and coffee can help your garden! Avoiding waste is the first step. ☕\n\n⭐⭐⭐⭐⭐ **REDUCE**\nUse a reusable tea strainer with loose-leaf tea instead of single-use bags. This completely eliminates the waste.\n\n⭐⭐⭐⭐ **RECYCLE (Compost)**\nThis is a fantastic option. Both are great for compost. Tear open plastic-based tea bags and compost only the leaves inside.\n\n⭐⭐ **REUSE**\nUsed tea leaves can soothe puffy eyes. Coffee grounds are a great natural exfoliant."}
{"input_text": "Broken glass", "output_text": "Broken glass is a safety hazard. The absolute priority is protecting sanitation workers. ⚠️\n\n⭐⭐⭐⭐⭐ **SAFE DISPOSAL**\nThis is not about recycling, it's about safety. Wrap the broken pieces thickly in newspaper, place them in a cardboard box, and clearly label it 'BROKEN GLASS'. Place this in your dry waste bin. This alerts the waste collector to handle it carefully."}
{"input_text": "Old bedsheets and curtains", "output_text": "Large textiles like bedsheets have a lot of life left in them, even when old! 🛌\n\n⭐⭐⭐⭐⭐ **REUSE**\nThe best path! Donate them to animal shelters who are always in need of bedding. You can also cut them up to make reusable bags, cushion covers, or cleaning cloths.\n\n⭐⭐ **RECYCLE**\nFind a local textile recycler. This is less common and harder to do than simple reuse, so it's a lower priority."}
{"input_text": "Old shoes", "output_text": "Don't just bin those old shoes! Giving them a second life is the best route. 👟\n\n⭐⭐⭐⭐⭐ **REUSE**\nIf they are still wearable, wash them and donate them to a local charity. A local cobbler ('mochi') can often repair them cheaply.\n\n⭐⭐ **RECYCLE**\nSome global brands have collection programs in their stores to recycle old shoes, but this is less accessible than direct reuse or repair."}
{"input_text": "Leftover paint cans", "output_text": "Paint is hazardous waste. The top priority is ensuring it doesn't harm the environment. 🎨\n\n⭐⭐⭐⭐⭐ **SAFE DISPOSAL**\nContact your local hazardous waste disposal facility. For small amounts of latex paint, leave the lid off until it completely dries out and solidifies before disposal. This makes it more stable.\n\n⭐⭐⭐ **REDUCE**\nCalculate your area carefully and buy only the amount of paint you need.\n\n⭐⭐ **REUSE**\nDonate usable leftover paint to community projects."}
{"input_text": "Household cleaner bottles", "output_text": "The bottles from household cleaners can often be recycled, but reducing them is even better! 🧴\n\n⭐⭐⭐⭐⭐ **REDUCE**\nMake your own simple cleaners using vinegar and baking soda. Buy concentrated refills that use less packaging.\n\n⭐⭐⭐ **REUSE**\nA sturdy spray bottle can be rinsed and reused many times for your homemade cleaners or for watering plants.\n\n⭐⭐ **RECYCLE**\nOnce the bottle is completely empty, rinse it out, screw the cap back on, and place it in your dry waste bin for recycling."}
{"input_text": "Broken mercury thermometer", "output_text": "DANGER! A broken mercury thermometer is a serious health hazard. The only goal is safety. 🌡️\n\n⭐⭐⭐⭐⭐ **SAFE DISPOSAL**\nThis is the ONLY action. NEVER vacuum or sweep mercury. Put on gloves, carefully collect the mercury beads using paper or an eyedropper, place it in a sealed glass container, and contact a hazardous waste facility or the KSPCB immediately for disposal instructions.\n\n⭐⭐⭐⭐⭐ **REDUCE**\nAs a preventative measure, switch to a digital thermometer immediately. They are safer and just as accurate."}
{"input_text": "Tetrapaks (juice/milk cartons)", "output_text": "Tetrapaks are composite cartons. Recycling them correctly is the most important step. 🧃\n\n⭐⭐⭐⭐ **RECYCLE**\nYes! Empty the carton, push the straw inside, flatten it, and put it in your dry waste bin. Specialized facilities can separate the layers. There are several collection points for these in Bengaluru.\n\n⭐⭐ **REDUCE**\nOpt for fresh juice or products in more easily recyclable packaging like glass."}